# CurrentObject Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarContainerIterator..::..CurrentObject Property
RebarContainerIterator Class See Also
---
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
internal Object CurrentObject { get; }
```

Visual Basic
---
```text
Friend ReadOnly Property CurrentObject As Object
	Get
```

Visual C++
---
```text
internal:
virtual property Object^ CurrentObject {
	Object^ get () sealed;
}
```

# ### Implements
IEnumerator..::..Current
# See Also
RebarContainerIterator Class
Autodesk.Revit.DB.Structure Namespace